var moviejson = 
[
    {
    "电影名": "五一七天乐", 
    "上映日期": "2011", 
    "参演影人": "毕福剑  王冠  于文华  韩兆  ", 
    "评分": "5.7"
  },
  {
    "电影名": "名为蒙斯的猫 Katten Mons", 
    "上映日期": "1995", 
    "参演影人": "Pjotr Sapegin  ", 
    "评分": "7.3"
  },
  {
    "电影名": "光杆司令 Army of One", 
    "上映日期": "2016", 
    "参演影人": "拉里·查尔斯  尼古拉斯·凯奇  温迪·麦克伦登-考威  拉塞尔·布兰德  丹尼斯·欧哈拉  肯·马里诺  ", 
    "评分": "5.3"
  },
  {
    "电影名": "鬼驱人 Poltergeist", 
    "上映日期": "2015", 
    "参演影人": "吉尔·克兰  山姆·洛克威尔  罗丝玛丽·德薇特  萨克斯·沙比诺  凯尔·凯特莱特  肯尼迪·克莱蒙兹  ", 
    "评分": "5.3"
  },
  {
    "电影名": "奇才工坊 第一季 A.N.T. Farm Season 1", 
    "上映日期": "2011", 
    "参演影人": "鲍勃·寇贝尔  琪娜·安妮·麦克兰  谢拉·麦克康米克  杰克·索特  斯戴芬妮·斯考特  亚历山德里娅·德伯里  ", 
    "评分": "6.7"
  },
  {
    "电影名": "天才除草人2 Lawnmower Man 2: Beyond Cyberspace", 
    "上映日期": "1996", 
    "参演影人": "Farhad Mann  埃利斯·威廉姆斯  帕特里克·博金  马特·弗里沃  特沃·欧布莱恩  莫莉·香侬  ", 
    "评分": "5.3"
  },
  {
    "电影名": "双生灵", 
    "上映日期": "2015", 
    "参演影人": "秦榛  车艺莲  常奕然  刘佳佳  刘冠麟  尹菲  ", 
    "评分": "3.4"
  },
  {
    "电影名": "Like A Brother", 
    "上映日期": "2002", 
    "参演影人": "Ryan Honey  Chuck Murphy  Damien Midkiff  Kassie Pinegar  Joseph Tsai  ", 
    "评分": "0.0"
  },
  {
    "电影名": "罪案第六感 第二季 Perception Season 2", 
    "上映日期": "2013", 
    "参演影人": "克里斯托弗·马西阿诺  安德鲁·伯恩斯坦  艾瑞克·麦柯马克  瑞切尔·蕾·库克  阿尔杰·史密斯  凯利·罗万  ", 
    "评分": "8.1"
  },
  {
    "电影名": "法外制裁者OAD3 コード:ブレイカー OAD3", 
    "上映日期": "2013", 
    "参演影人": "入江泰浩  冈本信彦  日笠阳子  铃村健一  ", 
    "评分": "6.7"
  },
  {
    "电影名": "下午狗叫", 
    "上映日期": "2007", 
    "参演影人": "张跃东  韩东  小河  董劲松  ", 
    "评分": "6.4"
  },
  {
    "电影名": "隐秘的激情 Pasión de gavilanes", 
    "上映日期": "2003", 
    "参演影人": "Rodrigo Triana  达纳·加西亚  Mario Cimarro  宝拉·雷  胡安·巴普蒂斯塔  Kristina Lilley  ", 
    "评分": "9.0"
  },
  {
    "电影名": "前夫总动员 第三季 The Exes Season 3", 
    "上映日期": "2013", 
    "参演影人": "大卫·阿伦·伯施理  凯莉·斯泰堡丝  查斯蒂·巴勒斯特罗斯  马里昂·罗斯  ", 
    "评分": "7.7"
  },
  {
    "电影名": "言情小说 Paperback Hero", 
    "上映日期": "1999", 
    "参演影人": "休·杰克曼  克劳迪娅·卡万  安琪·米利肯  Jeanie Drynan  安德鲁·S·吉尔伯特  Russell Dykstra  ", 
    "评分": "7.0"
  },
  {
    "电影名": "坎大哈 سفر قندهار", 
    "上映日期": "2001", 
    "参演影人": "莫森·玛克玛尔巴夫  Hassan Tantai  ", 
    "评分": "7.7"
  },
  {
    "电影名": "神偷卡门 第一季 Where on Earth Is Carmen Sandiego？ Season 1", 
    "上映日期": "1994", 
    "参演影人": "Chadwick Pelletier  丽塔·莫雷诺  斯科特·门维尔  蒂姆·克里  罗伯特伊图  亚历山大·昆泽内斯特罗夫  ", 
    "评分": "8.6"
  },
  {
    "电影名": "遭遇陌生人 You Will Meet A Tall Dark Stranger", 
    "上映日期": "2010", 
    "参演影人": "伍迪·艾伦  安东尼·霍普金斯  乔什·布洛林  娜奥米·沃茨  安东尼奥·班德拉斯  芙蕾达·平托  ", 
    "评分": "7.3"
  },
  {
    "电影名": "嗜血校园 Vamp U", 
    "上映日期": "2011", 
    "参演影人": "朱丽叶·冈扎罗  亚当·约翰逊  盖瑞·科尔  Matt Mattson  巴特·约翰逊  亚历克西斯·克纳普  ", 
    "评分": "4.1"
  },
  {
    "电影名": "超能先生和他的伙伴们 The Adventures of Mr. Incredible", 
    "上映日期": "2005", 
    "参演影人": "罗杰·古尔德  格雷格·T·尼尔森  塞缪尔·杰克逊  彼特·道格特  塞缪尔·杰克逊  布拉德·伯德  ", 
    "评分": "5.9"
  },
  {
    "电影名": "孔雀公主", 
    "上映日期": "1982", 
    "参演影人": "唐国强  李林  李雨农  蔡明  黄素影  吴桂苓  ", 
    "评分": "7.5"
  },
  {
    "电影名": "落语天女唯 落語天女おゆい", 
    "上映日期": "2006", 
    "参演影人": "野田顺子  泽城美雪  后藤沙绪里  小林优  ", 
    "评分": "5.9"
  },
  {
    "电影名": "星际旅行：舰长峰会 Star Trek: The Captains' Summit", 
    "上映日期": "2009", 
    "参演影人": "The Torture King  乌比·戈德堡  威廉·夏特纳  帕特里克·斯图尔特  伦纳德·尼莫伊  乔纳森·弗雷克斯  ", 
    "评分": "9.2"
  },
  {
    "电影名": "与歌同行 Walk the Line", 
    "上映日期": "2005", 
    "参演影人": "詹姆斯·曼高德  杰昆·菲尼克斯  瑞茜·威瑟斯彭  罗伯特·帕特里克  Shelby Lynne  达拉斯·罗伯特斯  ", 
    "评分": "7.8"
  },
  {
    "电影名": "七华6/17 ななか6/17", 
    "上映日期": "2003", 
    "参演影人": "樱井弘明  Chiemi Chiba  堀江由衣  铃村健一  金春智子  Toshio Masuda  ", 
    "评分": "7.3"
  },
  {
    "电影名": "End Call", 
    "上映日期": "2008", 
    "参演影人": "三轮瞳  芳贺优里亚  诹访太朗  Tomoya Imai  ", 
    "评分": "4.4"
  },
  {
    "电影名": "举起金刚 킹콩을 들다", 
    "上映日期": "2009", 
    "参演影人": "李凡秀  赵安  崔嬉序  全宝美  申正根  宋在熙  ", 
    "评分": "8.2"
  },
  {
    "电影名": "唐老鸭参军 Donald Gets Drafted", 
    "上映日期": "1942", 
    "参演影人": "杰克·金   克拉伦斯·纳什  比利·布莱彻  卡尔·巴克斯  杰克·汉娜  华特·迪士尼  ", 
    "评分": "8.7"
  },
  {
    "电影名": "青木原树海 Sea of Trees", 
    "上映日期": "2015", 
    "参演影人": "格斯·范·桑特  马修·麦康纳  渡边谦  娜奥米·沃茨  凯蒂·阿赛尔顿  乔丹·加文瑞斯  ", 
    "评分": "6.0"
  },
  {
    "电影名": "即兴说唱 Freestyle: The Art of Rhyme", 
    "上映日期": "2000", 
    "参演影人": "Kevin Fitzgerald  Myo Campbell  茅斯·达夫  Juice  Robert Garcia  Talib Kweli  ", 
    "评分": "9.3"
  },
  {
    "电影名": "少年包青天Ⅱ", 
    "上映日期": "2001", 
    "参演影人": "曾谨  胡明凯  陆毅  任泉  释小龙  范冰冰  ", 
    "评分": "6.8"
  },
  {
    "电影名": "心病难医 State Of Mind", 
    "上映日期": "2007", 
    "参演影人": "艾洛迪·基恩  亚当·阿金  莉莉·泰勒  Derek Riddell  特里萨·兰德尔  科里·索伦森  ", 
    "评分": "6.9"
  },
  {
    "电影名": "艾斯卡达的三次葬礼 The Three Burials of Melquiades Estrada", 
    "上映日期": "2005", 
    "参演影人": "汤米·李·琼斯  汤米·李·琼斯  巴里·佩珀  德怀特·尤科姆  詹纽瑞·琼斯  梅丽莎·里奥  ", 
    "评分": "7.8"
  },
  {
    "电影名": "入魔", 
    "上映日期": "1994", 
    "参演影人": "李惠民  翁虹  徐锦江  尹扬明  钟淑慧  ", 
    "评分": "5.5"
  },
  {
    "电影名": "铁道游击队", 
    "上映日期": "2005", 
    "参演影人": "陈咏歌  王新民  赵恒煊  史兰芽  刘长纯  矢野浩二  ", 
    "评分": "6.7"
  },
  {
    "电影名": "夏至物语", 
    "上映日期": "1992", 
    "参演影人": "岩井俊二  上田晋也  ", 
    "评分": "7.9"
  },
  {
    "电影名": "破发点 Break Point", 
    "上映日期": "2014", 
    "参演影人": "艾米·斯马特  亚当·德维尼  ", 
    "评分": "6.4"
  },
  {
    "电影名": "红闺梦 紅閨夢", 
    "上映日期": "1964", 
    "参演影人": "武智铁二   ", 
    "评分": "7.0"
  },
  {
    "电影名": "急速档：大电影 Top Gear at the Movies", 
    "上映日期": "2011", 
    "参演影人": "理查德·哈蒙德  詹姆斯·梅  ", 
    "评分": "8.0"
  },
  {
    "电影名": "美人鱼 PROJECT MERMAID", 
    "上映日期": "2007", 
    "参演影人": "押井守  ", 
    "评分": "4.5"
  },
  {
    "电影名": "月光光心慌慌 Halloween", 
    "上映日期": "2018", 
    "参演影人": "大卫·戈登·格林  杰米·李·柯蒂斯  布拉德·道里夫  约翰·卡朋特  丹尼·麦克布莱德  帕特里克·梅尔顿  ", 
    "评分": "0.0"
  },
  {
    "电影名": "第二次握手", 
    "上映日期": "1980", 
    "参演影人": "董克娜  谢芳  石羽  袁玫  康泰  王酩  ", 
    "评分": "6.6"
  },
  {
    "电影名": "真爱不灭 รักไม่มีวันตาย", 
    "上映日期": "2011", 
    "参演影人": "林柏光  赖拉·邦雅淑  查理·瑞纳  Kan Kantathavorn  ", 
    "评分": "7.7"
  },
  {
    "电影名": "强殖装甲 Guyver", 
    "上映日期": "1991", 
    "参演影人": "Screaming Mad George  王献篪  吉米·沃克  Spice Williams-Crosby  Brian Simpson  威拉德·E·普  ", 
    "评分": "4.4"
  },
  {
    "电影名": "蒂姆和泰迪 Tim og Tøffe", 
    "上映日期": "1949", 
    "参演影人": "伊佛·卡普里诺  ", 
    "评分": "0.0"
  },
  {
    "电影名": "佐佐木之战 佐々木夫妻の仁義なき戦い", 
    "上映日期": "2008", 
    "参演影人": "平川雄一朗  稻垣吾郎  小雪  小出惠介  酒井若菜  古田新太  ", 
    "评分": "6.9"
  },
  {
    "电影名": "乔治·詹特利探案 第七季 Inspector George Gently Season 7", 
    "上映日期": "2015", 
    "参演影人": "罗杰·戈比  马丁·肖  李·恩格里比  莉莎·麦格里利斯  杰里米·斯威夫特  艾伦·亨特  ", 
    "评分": "8.4"
  },
  {
    "电影名": "无敌大猩猩 Mighty Joe Young", 
    "上映日期": "1998", 
    "参演影人": "罗恩·安德伍德  比尔·帕克斯顿  查理兹·塞隆  拉德·舍博德兹加  泰瑞·摩尔  雷·哈里豪森  ", 
    "评分": "7.0"
  },
  {
    "电影名": "意外的旅客 The Accidental Tourist", 
    "上映日期": "1988", 
    "参演影人": "劳伦斯·卡斯丹  凯瑟琳·特纳  吉娜·戴维斯  威廉·赫特  乔恩·卡斯丹  比尔·普尔曼  ", 
    "评分": "7.6"
  },
  {
    "电影名": "超人总动员 The Incredibles", 
    "上映日期": "2004", 
    "参演影人": "布拉德·伯德  格雷格·T·尼尔森  霍利·亨特  塞缪尔·杰克逊  杰森·李  泰迪·牛顿  ", 
    "评分": "7.9"
  },
  {
    "电影名": "最佳污点 The Best of Blur", 
    "上映日期": "2000", 
    "参演影人": "Jamie Thraves  John Hardwick  达蒙·奥尔本  格拉翰姆·考可森  菲尔·丹尼尔斯  基思·艾伦  ", 
    "评分": "9.2"
  },
  {
    "电影名": "七月半之恐怖宿舍", 
    "上映日期": "2015", 
    "参演影人": "杜潇傲  余心恬  翟子陌  马元  付曼  陈美行  ", 
    "评分": "3.2"
  },
  {
    "电影名": "MTV 名人死斗 Celebrity Deathmatch", 
    "上映日期": "1998", 
    "参演影人": "戴夫·托马斯  詹姆斯·阿诺德·泰勒  克里·萨莫  罗伯特·丁克勒  Scottie Ray  Greg Siff  ", 
    "评分": "8.6"
  },
  {
    "电影名": "星际迷航3：超越星辰 Star Trek Beyond", 
    "上映日期": "2016", 
    "参演影人": "林诣彬  克里斯·派恩  扎克瑞·昆图  佐伊·索尔达娜  西蒙·佩吉  安东·叶利钦  ", 
    "评分": "7.3"
  },
  {
    "电影名": "邻座的怪同学 となりの怪物くん", 
    "上映日期": "2012", 
    "参演影人": "镝木宏  户松遥  铃木达央  逢坂良太  寺岛拓笃  花泽香菜  ", 
    "评分": "8.4"
  },
  {
    "电影名": "艳降 艷降", 
    "上映日期": "1993", 
    "参演影人": "余慕莲  ", 
    "评分": "5.0"
  },
  {
    "电影名": "封面男孩：最后的革命 Cover boy: L'ultima rivoluzione", 
    "上映日期": "2007", 
    "参演影人": "Carmine Amoroso  Eduard Gabia  Pavel Novotny  卢卡·莱奥内罗  苏珊·利  加布里埃尔·斯巴修  ", 
    "评分": "7.5"
  },
  {
    "电影名": "狼人就在你身边 Wolfen", 
    "上映日期": "1981", 
    "参演影人": "迈克尔·沃德利  阿尔伯特·芬尼   戴安·维诺拉  爱德华·詹姆斯·奥莫斯  格里高利·海因斯  Dick O'Neill  ", 
    "评分": "0.0"
  },
  {
    "电影名": "天使之城 City of Angels", 
    "上映日期": "1998", 
    "参演影人": "布拉德·塞伯宁  尼古拉斯·凯奇  梅格·瑞恩  安德鲁·布劳尔  丹尼斯·弗兰茨  科鲁姆·费奥瑞  ", 
    "评分": "7.9"
  },
  {
    "电影名": "飞哥与小佛 第三季 Phineas and Ferb Season 3", 
    "上映日期": "2011", 
    "参演影人": "丹·波文迈尔  Robert Hughes  文森特·马特拉  托马斯·布罗迪-桑斯特  阿什丽·提斯代尔  丹·波文迈尔  ", 
    "评分": "9.3"
  },
  {
    "电影名": "一個泰國女人的色情日記 Le journal érotique d'une Thailandaise", 
    "上映日期": "1980", 
    "参演影人": "茱莉亚·佩兰  ", 
    "评分": "0.0"
  },
  {
    "电影名": "你好，旧时光", 
    "上映日期": "2017", 
    "参演影人": "沙漠  李兰迪  张新成  周澄奥  李牵  许梦圆  ", 
    "评分": "8.5"
  },
  {
    "电影名": "二号交通站", 
    "上映日期": "2011", 
    "参演影人": "刘桦  尹相杰  那威  颜冠英  鲍大志  程思寒  ", 
    "评分": "6.6"
  },
  {
    "电影名": "生命的三秒半 Three and a Half Seconds About Life", 
    "上映日期": "2009", 
    "参演影人": "埃兰·希勒尔  ", 
    "评分": "7.3"
  },
  {
    "电影名": "上海", 
    "上映日期": "1938", 
    "参演影人": "龟井文夫  ", 
    "评分": "0.0"
  },
  {
    "电影名": "牧师之女 The Blackcoat's Daughter", 
    "上映日期": "2015", 
    "参演影人": "奥兹·珀金斯  艾玛·罗伯茨  琪兰·席普卡  罗伦·荷莉  詹姆斯·瑞马尔  露西·宝通  ", 
    "评分": "5.6"
  },
  {
    "电影名": "小鹿斑比 Bambi", 
    "上映日期": "1942", 
    "参演影人": "保罗·萨特菲尔德  比尔·罗伯茨  哈迪·奥尔布赖特  特尔玛·博德曼  小林桂树  拉里·莫里  ", 
    "评分": "8.2"
  },
  {
    "电影名": "爱爱对减肥的影响 섹스가 다이어트에 미치는 영향", 
    "上映日期": "2016", 
    "参演影人": "吴珠河  ", 
    "评分": "4.3"
  },
  {
    "电影名": "遇上我的真命天子 Prem Ratan Dhan Payo", 
    "上映日期": "2015", 
    "参演影人": "苏拉杰·R·巴贾特亚  萨尔曼·汗  索娜姆·卡普尔  阿努潘·凯尔  尼尔·尼汀·穆科什  迪帕克·迪布里亚尔  ", 
    "评分": "6.9"
  },
  {
    "电影名": "七合圣石战记 セイクリッドセブン", 
    "上映日期": "2011", 
    "参演影人": "大桥誉志光  寺岛拓笃  中岛爱  冈本信彦  入野自由  伊藤加奈惠  ", 
    "评分": "6.0"
  },
  {
    "电影名": "怪妈闯荡记 第三季 Odd Mom Out Season 3", 
    "上映日期": "2017", 
    "参演影人": "吉尔·卡格曼  安迪·巴克利  肖恩·克莱尔  艾比·艾略特  乔安娜·卡西迪  Byrdie Bell  ", 
    "评分": "8.7"
  },
  {
    "电影名": "散华礼弥 OAD3 さんかれあ 身はゾンビに…心は…", 
    "上映日期": "2012", 
    "参演影人": "木村良平  内田真礼  矢作纱友里  井口裕香  福圆美里  ", 
    "评分": "6.7"
  },
  {
    "电影名": "新丧尸出笼 Day of the Dead", 
    "上映日期": "2008", 
    "参演影人": "史蒂夫·迈纳  米娜·苏瓦丽  尼克·卡农  迈克·韦尔奇  安娜琳·麦考德  斯塔克·桑德斯  ", 
    "评分": "6.4"
  },
  {
    "电影名": "美人制造", 
    "上映日期": "2014", 
    "参演影人": "李慧珠  金世佳  杨蓉  邓萃雯  张哲瀚  杨恭如  ", 
    "评分": "5.6"
  },
  {
    "电影名": "转动的桌子 La table tournante", 
    "上映日期": "1988", 
    "参演影人": "保罗·格里莫尔  雅克·德米  马修·戴米  皮埃尔·切尔尼亚  利奥内尔·夏尔皮  阿努克·艾梅  ", 
    "评分": "8.0"
  },
  {
    "电影名": "400天 400 Days", 
    "上映日期": "2015", 
    "参演影人": "凯蒂·洛茨  布兰登·罗斯  本·费德曼  汤姆·卡瓦纳夫  戴恩·库克  ", 
    "评分": "3.5"
  },
  {
    "电影名": "初吻2 La boum 2", 
    "上映日期": "1982", 
    "参演影人": "克洛德·比诺托  苏菲·玛索  朗贝尔·维尔森  克洛德·布拉瑟  Alexandra Gonin  Pierre Cosso  ", 
    "评分": "7.5"
  },
  {
    "电影名": "亲密的敌人 L'ennemi intime", 
    "上映日期": "2007", 
    "参演影人": "弗洛朗-埃米利奥·西里  伯努瓦·马吉梅尔  阿尔贝·杜邦泰尔  奥雷利安·雷克因  马克·巴贝  埃里克·萨文  ", 
    "评分": "7.6"
  },
  {
    "电影名": "仲夏夜之梦 A Midsummer Night's Dream", 
    "上映日期": "1981", 
    "参演影人": "Elijah Moshinsky  Estelle Kohler  奈杰尔·达文波特  休·夸希  菲尔·丹尼尔斯  海伦·米伦  ", 
    "评分": "7.8"
  },
  {
    "电影名": "吸血猫", 
    "上映日期": "2011", 
    "参演影人": "小清水亚美  杉山纪彰  福山润  后藤邑子  前田希美  福山润  ", 
    "评分": "6.9"
  },
  {
    "电影名": "三面夏娃 The Three Faces of Eve", 
    "上映日期": "1957", 
    "参演影人": "农纳利·约翰逊  乔安娜·伍德沃德  大卫·斯佩德  李·科布  斯坦利·科尔特斯  David Hall  ", 
    "评分": "7.6"
  },
  {
    "电影名": "夺命凶灵2 Scanners II: The New Order", 
    "上映日期": "1991", 
    "参演影人": "克里斯丁·杜瓦  德博拉·拉芬  Yvan Ponton  Isabelle Mejias  汤姆·巴特勒  劳尔·特鲁希洛  ", 
    "评分": "6.1"
  },
  {
    "电影名": "宠物小精灵：超梦的逆袭 劇場版ポケットモンスター ミュウツーの逆襲", 
    "上映日期": "1998", 
    "参演影人": "汤山邦彦  松本梨香  大谷育江  三木真一郎  兴梠里美  山寺宏一  ", 
    "评分": "7.9"
  },
  {
    "电影名": "双喜盈门", 
    "上映日期": "2017", 
    "参演影人": "潘长江  丁子玲  肖光奕  张大静  陈嘉男  ", 
    "评分": "5.1"
  },
  {
    "电影名": "女忍2011 女忍 KUNOICHI", 
    "上映日期": "2011", 
    "参演影人": "武田梨奈  琴乃  ", 
    "评分": "2.7"
  },
  {
    "电影名": "明天发生的事情 It Happened Tomorrow", 
    "上映日期": "1944", 
    "参演影人": "雷内·克莱尔  迪克·鲍威尔  琳达·达内尔  杰克·奥克  'Snub' Pollard  Robert Homans  ", 
    "评分": "7.7"
  },
  {
    "电影名": "人中之龍新章 黑豹 クロヒョウ 龍が如く新章", 
    "上映日期": "2010", 
    "参演影人": "佐藤瑠生亮  斋藤工  波瑠  中野英雄  ", 
    "评分": "6.4"
  }
]

var svg = d3.select("#bubble"),
width = +svg.attr("width"),
height = +svg.attr("height");

var format = d3.format(",d");

var color = d3.scaleOrdinal(d3.schemeCategory20c);

var pack = d3.pack()
.size([width, height])
.padding(1.5);


moviejson.forEach(function(element) {
    element.name = element["电影名"]
    element.date = element["上映日期"]
    element.star = element["参演影人"]
    element.score = parseFloat(element["评分"])
    element.value = element.score ** 3;
    if (element.score == 0){element.value = 10;}
    element.package = element.name;
    element.class = element.star;
    }, this);


var root = d3.hierarchy({children: moviejson})
  .sum(function(d){return d.value; });
  
  // console.log(root);

  var node = svg.selectAll(".node")

  .data(pack(root).leaves())
  .enter().append("g")
    .attr("class", "node")
    .attr("transform", function(d) { return "translate(" + d.x + "," + d.y + ")"; });
  
  node.append("circle")
    .attr("date", function(d) { return d.date; })
    .attr("r", function(d) { return d.r; })
    .style("fill", function(d) { 
      // console.log(d);
      // console.log(d.data.package,'color:',color(d.data.package));
      
      return color(d.data.package); });

  node.append("text")
  .attr("clip-path", function(d) { 
    return "http://www.baidu.com";
    // return "url(#clip-" + d.date + ")"; 
  })
  .attr("width",function(d){return d.r/40;})
  .append("tspan")
    // .style("display", "inline-block")
    // .style("width", "60%")
    // .style("word-wrap","break-word")
    // .style("white-space", "normal")
    .attr("x", 0)
    .attr("y", 0)
    // .attr("y", function(d, i, nodes) { return 13 + (i - nodes.length / 2 - 0.5) * 10; })
    .append("a")
    // mouse picture modify
    // .attr("href","http://www.baidu.com")

  .text(function(d) { return d.data.name })
  .append("tspan")
  .attr("x", 0)
  .attr("y", 10)
  .text(function(d) { return d.data.score});

  node.append("title")
    .text(function(d) { return d.data.date + "\n" + d.data.star; });
  // console.log(node)

  

